In [2]:
import pandas as pd

x = pd.Series([1,4,6,8,8,9,9,10])
y = pd.Series([10,20,50,50,55,65,75,70,81,85])

In [4]:
df = pd.DataFrame([x,y], index = ("Tabungan", "Pendapatan")).T
df

   Tabungan  Pendapatan
0       1.0        10.0
1       4.0        20.0
2       6.0        50.0
3       8.0        50.0
4       8.0        55.0
5       9.0        65.0
6       9.0        75.0
7      10.0        70.0
8       NaN        81.0
9       NaN        85.0

In [7]:
df.corr(method = "spearman")

            Tabungan  Pendapatan
Tabungan    1.000000    0.939411
Pendapatan  0.939411    1.000000